# RotationZ Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalLinkType..::..RotationZ Property
AnalyticalLinkType Class See Also
---
Fixity of rotation around Z.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public AnalyticalFixityState RotationZ { get; set; }
```

Visual Basic
---
```text
Public Property RotationZ As AnalyticalFixityState
	Get
	Set
```

Visual C++
---
```text
public:
property AnalyticalFixityState RotationZ {
	AnalyticalFixityState get ();
	void set (AnalyticalFixityState value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The fixity state rotationZ is not valid for Analytical Link Type parameters. |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
AnalyticalLinkType Class
Autodesk.Revit.DB.Structure Namespace